testCases/Ichf/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      fu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.21;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.21;
        value           uniform 0.21;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 0.21;
        value           uniform 0.21;
    }
    base
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform .21;
    }
    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
