testCases/Ichf/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
          type            totalPressure;
//          type            fixedValue;
          value           uniform 101325;
          p0              uniform 101325;
//        type            buoyantPressure;
//        value           uniform 101325;
          gamma           1;
    }

    sides
    {
        type            zeroGradient;
//        type            buoyantPressure;
//        value           $internalField;
//        type            uniformDensityHydrostaticPressure;
//        rho             1.2;
//        pRefValue       101325;
//        pRefPoint       (0 0 0);
//        value           $internalField;
    }
    base
    {
        type            zeroGradient;
//        type            buoyantPressure;
//        value           $internalField;
    }
    inlet
    {
        type            zeroGradient;
//        type            buoyantPressure;
//        value           $internalField;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
