testCases/Ichf/constant/ignitionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignite false;
ignition
{
        timeStart 0;
        duration  500;
        ignOrigin (0.00 0.0 0.0);
        ignRadius 0.02;
        ignRate 1.0e8;
        verboseOutput true;
}

// ************************************************************************* //
