testCases/Ichf/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    base
    {
        type            patch;
        nFaces          200;
        startFace       39700;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       39900;
    }
    sides
    {
        type            patch;
        nFaces          200;
        startFace       40100;
    }
    frontAndBack
    {
        type            empty;
        nFaces          40000;
        startFace       40300;
    }
)


// ************************************************************************* //
