testCases/Ichf/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heterogeneousRadiationModel heterogeneousP1;

absorptionEmissionModel constantAbsorptionEmission;

solverFreq 10;

heterogeneousAbsorptionEmissionModel heterogeneousConstantAbsorptionEmission;

heterogeneousConstantAbsorptionEmissionCoeffs
{
    a               a  [ 0 -1  0 0 0 0 0 ] 20.0;
    as              as [ 0 -1  0 0 0 0 0 ] 20.0;
    borderAs        borderAs [ 0 -1  0 0 0 0 0 ] 20.0;
    e               e  [ 0 -1 0 0 0 0 0 ] 20.0;
    es              es [ 0 -1 0 0 0 0 0 ] 20.0;
    borderEs        borderEs [ 0 -1 0 0 0 0 0 ] 20.0;
    E               E  [ 1 -1 -3 0 0 0 0 ] 0.0;
}

scatterModel    constant;

sigma sigma [0 -1 0 0 0 0 0] 0;
C C [0 0 0 0 0 0 0] 0;

// ************************************************************************* //
