testCases/Ichf/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-05;
    }


    rhoFinal
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    }


    "(p|pKin)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.05;
    }


    "(p|pKin)Final"
    {
        $p;
        tolerance        1e-7;
        relTol           0.01;
    }


    "(U|k|epsilon|h)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(U|k|epsilon|h)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.1;
    }

    "(Yi|Ys|porosity)"
    {
    //    $hsFinal;

        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-05;

    }

    "(Yi|Ys|porosity)Final"
    {
    //    $hsFinal;

        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          1e-05;

    }

    Ts
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    rhos
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-06;
    }

    G
    {
        $p;
        tolerance       1e-05;
        relTol          0.1;
    }

    GFinal
    {
        $p;
        tolerance       1e-05;
        relTol          0.1;
    }
}


PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       2;
    nNonOrthogonalCorrectors 1;
}


relaxationFactors
{
p 	 0.3;
p_amb 	 0.3;
U 	 0.7;
hs	 0.7;
k	 0.5;
epsilon  0.5;
Yi 0.5;
}

// *************************************************************************//

