testCases/Ichf/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue porosityF  1.0 
    volScalarFieldValue porosityF0 1.0 
    volScalarFieldValue Ts         300.0
    volScalarFieldValue T          300.0
);

regions
(
    boxToCell
    {
        box (-0.5 0.0 -0.01) (-0.4 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (-0.3 0.0 -0.01) (-0.2 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (-0.2 0.0 -0.01) (-0.1 0.1 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (-0.2 0.2 -0.01) (-0.1 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (0.0 0.0 -0.01) (0.1 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (0.2 0.0 -0.01) (0.3 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (0.1 0.1 -0.01) (0.2 0.2 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (0.4 0.0 -0.01) (0.5 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (0.5 0.23 -0.01) (0.6 0.3 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

    boxToCell
    {
        box (0.5 0.1 -0.01) (0.6 0.16 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF  .30  
            volScalarFieldValue porosityF0 .30 
            volScalarFieldValue Ts         600
        );
    }

);

// ************************************************************************* //
